
### Helmfile Diff


```diff


Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_nat_gateway.ng-dev will be created
  + resource "azurerm_nat_gateway" "ng-dev" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "centralindia"
      + name                    = "ng-dev"
      + resource_group_name     = "dev-rg"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "CreatedByTerraform" = "true"
          + "Environment"        = "dev"
          + "OwningProjects"     = "All"
        }
    }

  # azurerm_nat_gateway_public_ip_association.ng-dev-associate-public-ip will be created
  + resource "azurerm_nat_gateway_public_ip_association" "ng-dev-associate-public-ip" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # azurerm_public_ip.ip-dev will be created
  + resource "azurerm_public_ip" "ip-dev" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralindia"
      + name                    = "ip-dev"
      + resource_group_name     = "dev-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CreatedByTerraform" = "true"
          + "Environment"        = "dev"
          + "OwningProjects"     = "All"
        }
    }

  # azurerm_resource_group.dev-rg will be created
  + resource "azurerm_resource_group" "dev-rg" {
      + id       = (known after apply)
      + location = "centralindia"
      + name     = "dev-rg"
      + tags     = {
          + "CreatedByTerraform" = "true"
          + "Environment"        = "dev"
          + "OwningProjects"     = "All"
        }
    }

  # azurerm_subnet.subnet-pub-dev-01 will be created
  + resource "azurerm_subnet" "subnet-pub-dev-01" {
      + address_prefixes                               = [
          + "192.168.18.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-pub-dev-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dev-rg"
      + virtual_network_name                           = "vnet-dev"
    }

  # azurerm_subnet_nat_gateway_association.name will be created
  + resource "azurerm_subnet_nat_gateway_association" "name" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_virtual_network.vnet-dev will be created
  + resource "azurerm_virtual_network" "vnet-dev" {
      + address_space       = [
          + "192.168.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "centralindia"
      + name                = "vnet-dev"
      + resource_group_name = "dev-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "CreatedByTerraform" = "true"
          + "Environment"        = "dev"
          + "OwningProjects"     = "All"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```
